0/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            slip;
    }
    wall
    {
       type            nutLowReWallFunction;
       value           uniform 0;
    }
    floor
    {
        type            nutLowReWallFunction;
	value		uniform 0;
    }


    body
    {
        type            nutLowReWallFunction;
	value		uniform 0;
    }

    defaultFaces
    {
        type            calculated;
        value           uniform 0;
    }
} 	// ************************************************************************* //

