0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 8.399;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 8.399;
    }

    outlet
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            slip;
    }
    wall
    {
    	type 		omegaWallFunction;
	value		uniform 0;
    }
    floor
    {
    	type 		omegaWallFunction;
	value		uniform 0;
    }
    body
    {
    	type 		omegaWallFunction;
	value		uniform 0;
    }

    defaultFaces
    {
        type            fixedValue;
        value           uniform 1e-10;
    }

}


// ************************************************************************* //
